Autodesk.Revit.DB.PartUtils.GetPartMakerMethodToDivideVolumeFW(Autodesk.Revit.DB.PartMaker)
Obtains the object allowing access to the divided volume
properties of the PartMaker.
partMaker:
The PartMaker.
Returns:
The object handle. Returns null if the
PartMaker does not represent divided volumes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.IsPartDerivedFromLink(Autodesk.Revit.DB.Part)
Is the Part derived from link geometry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.GetMergedParts(Autodesk.Revit.DB.Part)
Retrieves the element ids of the source elements of a merged part.
part:
A merged part.
Returns:
The element ids of the parts that were merged to create the specified merged part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified Part is not a merged part.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.IsMergedPart(Autodesk.Revit.DB.Part)
Is the Part the result of a merge.
Returns:
True if the Part is the result of a merge operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.FindMergeableClusters(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Segregates a set of elements into subsets which are
valid for merge.
Remarks:
Element ids in the input set that do not correspond to Part
elements will be ignored, as will element ids corresponding
to Part elements that already have associated parts.
doc:
The document.
partIds:
A set of element ids.
Returns:
An array of clusters such that all the elements in a single cluster
are valid for merge. Each cluster will be maximal in that appending
any of the other Parts specified as input will result in a collection
that is not valid for merge.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.CreateMergedPart(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Create a single merged part which represents the Parts
specified by partsToMerge.
document:
The document.
partIds:
The elements that the merged part will be created from.
Returns:
The newly created PartMaker. null if no parts are merged.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not suitable for merging with the others.
Specified elements should all be Parts, report the same material,
creation and demolition phases, and have contiguous geometry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.PartUtils.ArePartsValidForMerge(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Identifies whether Part elements may be merged.
document:
The document.
partIds:
Element ids of Parts.
Returns:
True if all element ids correspond to Part elements,
none of the parts already has associated parts,
the parts have contiguous geometry, all report the same materials,
and all have the same creation and demolition phases.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.GetAssociatedPartMaker(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets associated PartMaker for an element.
hostDocument:
The document
elementId:
The id for the element to be checked for associated Parts
Returns:
The PartMaker element that is making Parts for this element.
null if there is no associated PartMaker.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PartUtils.GetAssociatedPartMaker(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.LinkElementId)
Gets associated PartMaker for an element.
hostDocument:
The document
hostOrLinkElementId:
The id for the element to be checked for associated Parts
Returns:
The PartMaker element that is making Parts for this element.
null if there is no associated PartMaker.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.GetAssociatedParts(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Boolean,System.Boolean)
Returns all Parts that are associated with the given element.
hostDocument:
The document of the element.
elementId:
The element to be checked for associated Parts.
includePartsWithAssociatedParts:
If true, include parts that have associated parts.
includeAllChildren:
If true, return all associated Parts recursively for all children.
If false, only return immediate children.
Returns:
Parts that are associated to the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PartUtils.GetAssociatedParts(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.LinkElementId,System.Boolean,System.Boolean)
Returns all Parts that are associated with the given element
hostDocument:
The document of the element
hostOrLinkElementId:
The element to be checked for associated Parts.
includePartsWithAssociatedParts:
If true, include parts that have associated parts
includeAllChildren:
If true, return all associated Parts recursively for all children
If false, only return immediate children
Returns:
Parts that are associated to the element
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.HasAssociatedParts(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if an element has associated parts.
hostDocument:
The document.
elementId:
The element to be checked for associated Parts
Returns:
True if the element has associated Parts.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PartUtils.HasAssociatedParts(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.LinkElementId)
Checks if an element has associated parts.
hostDocument:
The document.
hostOrLinkElementId:
The element to be checked for associated Parts.
Returns:
True if the element has associated Parts.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.GetChainLengthToOriginal(Autodesk.Revit.DB.Part)
Calculates the length of the longest chain of divisions/merges to reach to an original non-Part element that is the source of the tested part.
part:
The part to be tested
Returns:
The length of the longest chain.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.ArePartsValidForDivide(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Identifies if provided members are valid for dividing parts.
document:
The document.
elementIdsToDivide:
Element ids to be tested for validity for dividing parts.
Returns:
True if all member ids are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.AreElementsValidForCreateParts(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Identifies if the given elements can be used to create parts.
document:
The document.
elementIds:
Element ids to be tested for validity for creating parts.
Returns:
True if all member ids are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PartUtils.GetSplittingCurves(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Plane@)
Identifies the curves that were used to create the part and the plane in which they reside.
document:
The source document of the part.
partId:
The part id.
sketchPlane:
The plane in which the division curves were sketched.
Returns:
The curves that created the part. Empty if partId is not a part or Part is not divided.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019.1

Autodesk.Revit.DB.PartUtils.GetSplittingCurves(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies the curves that were used to create the part.
document:
The source document of the part.
partId:
The part id.
Returns:
The curves that created the part. Empty if partId is not a Part or Part is not divided.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019.1

Autodesk.Revit.DB.PartUtils.GetSplittingElements(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies the elements ( reference planes, levels, grids ) that were used to create the part.
document:
The source document of the part.
partId:
The part id.
Returns:
The elements that created the part. Empty if partId is not a Part or Part is not divided.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019.1

Autodesk.Revit.DB.PartUtils.IsValidForCreateParts(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.LinkElementId)
Identifies if the given element can be used to create parts.
document:
The document.
hostOrLinkElementId:
Id to be tested for validity for creating part.
Returns:
True if this id is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.DivideParts(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.ElementId)
Creates divided parts out of parts.
document:
The document containing the parts.
elementIdsToDivide:
The elements that will be divided.
intersectingReferenceIds:
Intersecting references that will divide the elements.
curveArray:
Array of curves that will divide the elements.
sketchPlaneId:
SketchPlane id for the curves that divide the elements.
Returns:
The newly created PartMaker. null if no parts are divided.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted for dividing parts.
Elements should be parts that are not yet divided and maximum distance from an original has not yet been reached.
-or-
One or more element ids was not permitted as intersecting references.
Intersecting references should be levels, grids, or reference planes.
-or-
The element id should refer to a valid SketchPlane.
-or-
The input curveArray contains at least one helical curve and is not supported for this operation.
-or-
The input curveArray contains at least one NULL pointer and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.PartUtils.CreateParts(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Creates a new set of parts out of the original elements.
Remarks:
Parts will be added to the model after regeneration.
document:
The document containing the elements.
elementIds:
The elements that parts will be created from.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted for creating parts.
Elements should be of a valid category and the ids should be valid and should not already be divided into parts.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.PartUtils.CreateParts(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.LinkElementId})
Creates a new set of parts out of the original elements.
Remarks:
Parts will be added to the model after regeneration.
To get the ids of the parts created by this method use PartUtils.GetAssociatedParts() with the contents of hostOrLinkElementIds.
document:
The document containing the elements.
hostOrLinkElementIds:
The elements that parts will be created from.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted for creating parts.
HostOrLinkElements should be of a valid category and the ids should be valid and should not already be divided into parts.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.PartUtils
General Part utility methods
Since:
2012